### IMPUTASI

### Mean

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
kolom = {'col1':[2, 9, 19],
         'col2':[5, np.nan, 17],
         'col3':[4, np.nan, 22],
         'col4':[6, 6, 25],
         'col5':[np.nan, 5, np.nan]}
         
data = pd.DataFrame(kolom)

In [4]:
data

   col1  col2  col3  col4  col5
0     2   5.0   4.0     6   NaN
1     9   NaN   NaN     6   5.0
2    19  17.0  22.0    25   NaN

In [5]:
data.fillna(data.mean())

   col1  col2  col3  col4  col5
0     2   5.0   4.0     6   5.0
1     9  11.0  13.0     6   5.0
2    19  17.0  22.0    25   5.0

### Arbitrary ( nilai suka suka )

In [6]:
umur = {'umur' : [29, 30, np.nan, 3, 7, 8, 40]}

data = pd.DataFrame(umur)
data

   umur
0  29.0
1  30.0
2   NaN
3   3.0
4   7.0
5   8.0
6  40.0

In [7]:
data.fillna(99)

   umur
0  29.0
1  30.0
2  99.0
3   3.0
4   7.0
5   8.0
6  40.0

In [10]:
pip install feature-engine

Collecting feature-engine
  Downloading feature_engine-1.2.0-py2.py3-none-any.whl (205 kB)
     |████████████████████████████████| 205 kB 8.4 MB/s
Collecting statsmodels>=0.11.1
  Downloading statsmodels-0.13.2-cp37-cp37m-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (9.8 MB)
     |████████████████████████████████| 9.8 MB 24.5 MB/s
Requirement already satisfied: scipy>=1.4.1 in /usr/local/lib/python3.7/dist-packages (from feature-engine) (1.4.1)
Requirement already satisfied: numpy>=1.18.2 in /usr/local/lib/python3.7/dist-packages (from feature-engine) (1.21.5)
Requirement already satisfied: pandas>=1.0.3 in /usr/local/lib/python3.7/dist-packages (from feature-engine) (1.3.5)
Requirement already satisfied: scikit-learn>=0.22.2 in /usr/local/lib/python3.7/dist-packages (from feature-engine) (1.0.2)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas>=1.0.3->feature-engine) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in /usr/local/lib/python3.7/dist-packages (from pandas>=1.0.3->feature-engine) (2018.9)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas>=1.0.3->feature-engine) (1.15.0)
Requirement already satisfied: joblib>=0.11 in /usr/local/lib/python3.7/dist-packages (from scikit-learn>=0.22.2->feature-engine) (1.1.0)
Requirement already satisfied: threadpoolctl>=2.0.0 in /usr/local/lib/python3.7/dist-packages (from scikit-learn>=0.22.2->feature-engine) (3.1.0)
Requirement already satisfied: packaging>=21.3 in /usr/local/lib/python3.7/dist-packages (from statsmodels>=0.11.1->feature-engine) (21.3)
Requirement already satisfied: patsy>=0.5.2 in /usr/local/lib/python3.7/dist-packages (from statsmodels>=0.11.1->feature-engine) (0.5.2)
Requirement already satisfied: pyparsing!=3.0.5,>=2.0.2 in /usr/local/lib/python3.7/dist-packages (from packaging>=21.3->statsmodels>=0.11.1->feature-engine) (3.0.7)
Installing collected packages: statsmodels, feature-engine
  Attempting uninstall: statsmodels
    Found existing installation: statsmodels 0.10.2
    Uninstalling statsmodels-0.10.2:
      Successfully uninstalled statsmodels-0.10.2
Successfully installed feature-engine-1.2.0 statsmodels-0.13.2

In [8]:
from feature_engine import imputation
#import EndTailImputer
from feature_engine.imputation import EndTailImputer

#buat Imputer
imputer = EndTailImputer(imputation_method='gaussian', tail='right')

#fit-kan imputer ke set
imputer.fit(data)

#ubah data
test_data = imputer.transform(data)

#yuk tampil data
test_data

        umur
0  29.000000
1  30.000000
2  65.616158
3   3.000000
4   7.000000
5   8.000000
6  40.000000

### Imputasi Modus

In [9]:
from sklearn.impute import SimpleImputer
mobil = {'mobil' : ['Honda', 'Toyota', 'Suzuki', 'Daihatsu', np.nan, np.nan, 'Nissan']}

data = pd.DataFrame(mobil)
data

      mobil
0     Honda
1    Toyota
2    Suzuki
3  Daihatsu
4       NaN
5       NaN
6    Nissan

In [10]:
imp = SimpleImputer(strategy= 'most_frequent')

In [11]:
imp.fit_transform(data)

array([['Honda'],
       ['Toyota'],
       ['Suzuki'],
       ['Daihatsu'],
       ['Daihatsu'],
       ['Daihatsu'],
       ['Nissan']], dtype=object)

Cara mengatasi missing value untuk kategorikal dan numerikal secara bersamaan = random sample

In [12]:
#import random sample
from feature_engine.imputation import RandomSampleImputer

#buat data yang ada missing value
data = {'Jenis Kelamin': ['Laki-laki', 'Perempuan', 'Laki-laki', np.nan, 'Laki-laki','Perempuan','Perempuan', np.nan, 'Laki-laki'],
        'Umur' : [29, np.nan, 32, 33, 22, np.nan, 52, np.nan, 13]}

df = pd.DataFrame(data)

In [13]:
df

  Jenis Kelamin  Umur
0     Laki-laki  29.0
1     Perempuan   NaN
2     Laki-laki  32.0
3           NaN  33.0
4     Laki-laki  22.0
5     Perempuan   NaN
6     Perempuan  52.0
7           NaN   NaN
8     Laki-laki  13.0

In [14]:
#buat imputer
imputer = RandomSampleImputer(random_state=29)

#fit kan
imputer.fit(df)

#ubah data
testing_df = imputer.transform(df)

In [15]:
testing_df

  Jenis Kelamin  Umur
0     Laki-laki  29.0
1     Perempuan  13.0
2     Laki-laki  32.0
3     Perempuan  33.0
4     Laki-laki  22.0
5     Perempuan  22.0
6     Perempuan  52.0
7     Laki-laki  52.0
8     Laki-laki  13.0